public class Signature_Raihana {
    public static void main(String[] args) {
        System.out.println("⠟⠛⠛⢛⣛⡛⠛⠿⢿⣿⣯⣭⢻⣿⢟⣭⣿⣿⡿⠿⠛⣛⣛⠛⠛⠛⢻");
        System.out.println("⣷⣄⠀⢛⣛⢰⣿⣶⣦⣍⠻⣿⡏⡟⣼⡿⢛⣡⣴⣶⣷⡆⣛⡃⠀⣰⣿");
        System.out.println("⣿⣿⣧⠀⢺⣬⡭⢛⣛⣿⢷⣎⠻⠃⢋⣴⢿⣿⣛⡛⢭⣬⡓⠀⣼⣿⣿");
        System.out.println("⣿⣿⣿⣆⠀⠐⠯⡈⠿⠿⡛⢚⡁⠀⣈⡚⣛⠿⠿⠡⠝⠂⢀⣼⣿⣿⣿");
        System.out.println("⣿⣿⣿⣿⣷⡦⠀⣢⣿⡾⣫⢗⢅⢀⢪⡫⣿⢷⣯⣆⠠⣴⣿⣿⣿⣿⣿");
        System.out.println("⣿⣿⣿⣿⣿⡃⠠⡙⡉⡺⣣⡏⣼⣿⡆⢳⡝⠇⣙⣋⠀⢸⣿⣿⣿⣿⣿");
        System.out.println("⣿⣿⣿⣿⣿⣧⠀⠸⢓⢳⡿⢠⣿⣿⣿⡈⣿⠘⡘⠊⠀⣽⣿⣿⣿⣿⣿");
        System.out.println("⣿⣿⣿⣿⣿⣿⣷⡄⣤⣴⣶⣿⣿⣿⣿⣷⣶⣦⡄⢰⣿⣿⣿⣿⣿⣿⣿");
        System.out.println("⣿⣿⣿⣿⣿⣿⡏⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⣻⣿⣿⣿⣿⣿⣿");

        String butterfly = new String(Character.toChars(0x1F98B)); // 🦋
        System.out.println("========================================");
        System.out.println("Raihana Nur Azizah " + butterfly + " (NPM: 2406413426)");
    }
}
 